--Лабораторна робота номер 3
    --Студента групи кн-31 підгрупа 2
    --Кульковця Віктора Васильовича             
    --Варіант 3
    -- Ознайомитись з системою типiв та класiв типiв. Набути досвiду визначення
    -- нових типiв та класiв типiв i їх використання.


    -- Основне завдання (#4)
    -- Фiгури на площинi. Використовуються такi фiгури, як коло (центр та ра-
    -- дiус), прямокутник (координати лiвої верхньої та правої нижньої точок), три-
    -- кутник (координати вершин) та мiтка — label (координати лiвої нижньої точки,
    -- шрифт та рядок). Доступнi шрифти — Consolas, Lucida Console та Source Code
    -- Pro. Визначити функцiю для отримання прямокутника, який мiстить усi фiгури
    -- iз заданого списку;




    -- Висновок: на даній лабораторній роботі було набуто досвіду з визначенням рекурсивних функцій, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.