    --Лабораторна робота номер 2
    --Студента групи кн-31 підгрупа 2
    --Кульковця Вgit pull origin branchname --allow-unrelated-historiesіктора Васильовича
    --Варіант 3
    --Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.

    -------------------
    -- Перша частина
    --Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з застосуванням вбудованих функцiй.


    -- Друга частина 
    -- Функцiя приймає двi логiчнi величини (Bool) i повертає їх у формi впорядкованої за спаданням двiйки (кортежа).

   
    -- Висновок
