    --Лабораторна робота номер 2
    --Студента групи кн-31 підгрупа 2
    --Кульковця Віктора Васильовича             
    --Варіант 3
    --Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.

    -------------------
    -- Перша частина
    --Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з застосуванням вбудованих функцiй.
    --Знайти n-й справа елемент списку.
    nel n mas1 = last (take n (reverse(mas1)))


    -- Друга частина 
    -- Циклiчний правий зсув списку на n позицiй.

    rShift :: Int -> [a] -> [a]
    rShift 0 x = x
    rShift _ []= []
    rShift 1 (x:xs)= xs ++ [x]
    rShift n x = rShift (n-1) (rShift 1 x)

    -- Висновок: на даній лабораторній роботі було набуто досвіду з визначенням рекурсивних функцій, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.