    --Лабораторна робота номер 3
    --Студента групи кн-31 підгрупа 2
    --Кульковця Віктора Васильовича             
    --Варіант 3
    --Мета: Набути досвiду визначення та використання функцiй вищого порядку.

    -------------------
    -- Перша частина
    --Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з застосуванням вбудованих функцiй.
    --Перетворити багаторiвневий список на однорiвневий.
    --BEZ


    --Z
    qwe q = concat (map (\(x,y) -> [x,y]) q)

    -- Друга частина 
    -- Визначити, чи є число простим.
    --BEZ
    hasLength :: Integral count => [a] -> count -> Bool
    _        `hasLength` n | n < 0 = False
    []       `hasLength` n         = n == 0
    (_ : xs) `hasLength` n         = xs `hasLength` (pred n)
    isPrime k = [ x | x <- [2..k], k `mod` x == 0] `hasLength` 1
    --Z
    factors n = [x | x <- [1..n], mod n x == 0]
    prime n = factors n == [1,n]

    -- Висновок: на даній лабораторній роботі було набуто досвіду з визначенням рекурсивних функцій, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.